import Container from "../components/Container";
import Content from "../components/Content";
import Sidebar from "../components/Sidebar";
import Header from "../components/Header";
import { BiSolidDetail } from "react-icons/bi";

const About = () => {
  return (
    <Container>
      <Sidebar />
      <Content id={"about"}>
        <Header
          title={"รายละเอียดโปรเจค"}
          icon={<BiSolidDetail className="icon" />}
        />
        <img
          src={"imgs/MERN.png"}
          alt="MERN-img"
          loading="lazy"
          title="รููปภาพ MERN Stack ที่ใช้"
        />
        <article>
          ประเจคนี้ทำเกี่ยวกับเว็บไซต์จัดการสินค้าโดยสินค้าในที่นี้จะสมมุติว่าเป็น
          หนังสือ ล่ะกันเราได้ใช้ MERN-Stack ในการสร้างเว็บไซต์ตัวนี้
          โดยฝั่งหน้าบ้านใช้ ReactJS ฝั่งหลังบ้านใช้ ExpressJS ฐานข้อมูลใช้
          MongoDB และ runtime ใช้ NodeJS
          โดยหลักการทำงานของเว็บไซต์ตัวนี้แบบเบื้องต้นเมื่อเปิด run development
          ให้เริ่มทำงานในฝั่งหน้าบ้านและฝั่งหลังบ้าน หน้าบ้านที่ใช้ ReactJS
          เมื่อผู้ใช้เลือกกดไปที่เมนูในแถบด้านข้างของเว็บไซต์จะทำการเปลี่ยน page
          ไปยังหน้าต่างๆของเว็บไซต์ให้ใช้งานโดยบาง page
          ของเว็บไซต์จะให้ทำการติดต่อไปที่หลังบ้านที่ใช้ ExpressJS
          จะคอยจัดการให้บริการด้านข้อมูลต่างๆ (Web API)
          ที่ถูกติดต่อมาจะฝั่งหน้าบ้านเมื่อ request ถูกส่งมาและ server จะรับ
          request (บาง request จะแนบข้อมูลติดไปด้วยเพื่อนำไปใช้ต่อใน server)
          เหล่านั้นและจะทำการเชื่อมต่อกับฐานข้อมูลที่เป็น MongoDB
          ให้ดึงข้อมูลจาก collection สินค้าที่เก็บไว้แล้วส่งข้อมูล response
          กลับไปเป็นข้อมูล JSON
          แล้วนำข้อมูลสินค้าที่ได้นั้นมาแสดงบนหน้าเว็บไซต์นั้นเอง
          โดยจะมีฟีเจอร์หลักๆอยู่ด้วยกัน 4 อันได้แก่
          <ol start={1}>
            <li>ระบบเพิ่มรายการสินค้า</li>
            <li>ระบบอัปเดตรายการสินค้า</li>
            <li>ระบบลบรายการสินค้า</li>
            <li>ระบบดูรายการสินค้า</li>
          </ol>
          แล้วจะมีฟีเจอร์ย่อยอีกๆหลายอันด้วยกันตามมา
          โดยหลักๆที่ทำโปรเจคนี้เพื่อต้องการที่จะฝึก skills
          ให้มีความเชี่ยวชาญในหลายๆงานหลายๆหน้าที่เพราะจากการทำโปรเจคนี้
          ได้ทำอะไรหลายอย่างไม่ว่าจะเป็นการออกแบบตกแต่งเว็บไซต์ที่เป็นหน้าที่หลักของ
          Frontend
          อย่างเราแล้วต้องทำการกรองข้อมูลการตวรจสอบข้อมูลจากผู้ใช้กรอกมาให้ถูกต้องและส่งข้อมูล
          ไปให้ server จัดการต่อ ในส่วน Backend
          ได้ฝึกการจัดการๆกับข้อมูลที่รับมาและต้องนำไปใช้เปลี่ยนแปลงข้อมูลหรือเพิ่มให้ใน
          database แล้วเอาข้อมูลจาก database ส่งไปให้หน้าบ้าน เพื่อให้ Frontend
          นำเอาข้อมูลมาแสดงให้ผู้ใช้งานได้เห็น
        </article>
      </Content>
    </Container>
  );
};

export default About;
